app/controllers/home_controller.rb

  def index
    @user = current_user
    @all_responses = Response.all.count
    @panic = Response.where(answer: "panic").count
---
SELECT COUNT(*) FROM "responses" WHERE "responses"."answer" = 'panic'