app/controllers/home_controller.rb

  def index
    @user = current_user
    @all_responses = Response.all.count == 0 ? 1 : Response.all.count
---
SELECT "responses".* FROM "responses"