app/controllers/responses_controller.rb

  def create
    @response = Response.create(answer: params[:response][:answer], user_id: current_user.id)
---
INSERT INTO "responses" ("answer", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["answer", "panic"], ["created_at", Thu, 10 Apr 2014 18:10:13 UTC +00:00], ["updated_at", Thu, 10 Apr 2014 18:10:13 UTC +00:00], ["user_id", 1]]

  def mobile_create
    @mobile_response = Response.create(answer: params[:answer], email: params[:email], cohort: params[:cohort], student_data: true)
---
INSERT INTO "responses" ("answer", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["answer", "learning"], ["created_at", Thu, 10 Apr 2014 18:45:11 UTC +00:00], ["updated_at", Thu, 10 Apr 2014 18:45:11 UTC +00:00]]