app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "responses" WHERE "responses"."answer" = 'panic' AND "responses"."user_id" = 1
---
  def retrieve_results
    @user = User.find(params[:id])

     render json: { "panic" => Response.where(:answer => "panic", :user_id => @user.id).count,
     "panic_edge" => Response.where(:answer => "panic edge", :user_id => @user.id).count,
     "learning" => Response.where(:answer => "learning", :user_id => @user.id).count,
     "comfort_edge" => Response.where(:answer => "comfort edge", :user_id => @user.id).count,
     "comfort" => Response.where(:answer => "comfort", :user_id => @user.id).count }